In [3]:
#Import library 
import pandas as pd 
from pathlib import Path 
%matplotlib inline

#Set file path and read in csv as dataframe 
csv_path=Path('Resources.csv') 
budget_data=pd.read_csv(csv_path) 
budget_data

      Date  Profit/Losses
0   Jan-10         867884
1   Feb-10         984655
2   Mar-10         322013
3   Apr-10         -69417
4   May-10         310503
..     ...            ...
81  Oct-16         102685
82  Nov-16         795914
83  Dec-16          60988
84  Jan-17         138230
85  Feb-17         671099

[86 rows x 2 columns]

In [4]:
#Set the date as the index 
budget_data.set_index(budget_data['Date'], inplace=True) 
budget_data.head()

          Date  Profit/Losses
Date
Jan-10  Jan-10         867884
Feb-10  Feb-10         984655
Mar-10  Mar-10         322013
Apr-10  Apr-10         -69417
May-10  May-10         310503

In [5]:
#Drop the Date column 
budget_data.drop(columns=['Date'], inplace=True) 
budget_data

        Profit/Losses
Date
Jan-10         867884
Feb-10         984655
Mar-10         322013
Apr-10         -69417
May-10         310503
...               ...
Oct-16         102685
Nov-16         795914
Dec-16          60988
Jan-17         138230
Feb-17         671099

[86 rows x 1 columns]

In [7]:
#Use the sum function to get the net amount of profit/losses 
budget_total=budget_data.sum(axis=None, skipna=None, level=None, numeric_only=None, min_count=0) 
budget_total

Profit/Losses    38382578
dtype: int64

In [9]:
#Get the daily percent change 
budget_changes=budget_data.diff() 
budget_changes.head()

        Profit/Losses
Date
Jan-10            NaN
Feb-10       116771.0
Mar-10      -662642.0
Apr-10      -391430.0
May-10       379920.0

In [11]:
#Add the daily percent changes to get the total amount of changes 
budget_returns=budget_changes.mean()
budget_returns

Profit/Losses   -2315.117647
dtype: float64

In [12]:
#Get the largest increase in profits 
budget_max=budget_changes.max() 
budget_max

Profit/Losses    1926159.0
dtype: float64

In [13]:
#Get the greatest decrease in profits 
budget_min=budget_changes.min() 
budget_min

Profit/Losses   -2196167.0
dtype: float64

In [ ]:
#Print out results 
print('Financial Analysis') print('---------------------') print(f"Total Profit/Losses {budget_total[0]}") print(f'Average Change {budget_returns[0]}') print(f"Greatest Increase in Profts {budget_max[0]}") print(f"Greatest Decrease in Profts {budget_min[0]}")